validation/polydisperseBubbleFoam/Delft/Delft_2_poly/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .01;

w       15;
h       120;
depth   5;

cellSize    0.5;

nPtsWide    #calc "$w/$cellSize";
nPtsHigh    #calc "$h/$cellSize";
nDepthPts   1;

vertices
(
    (   0       0       0       )   //0
    (   $w      0       0       )   //1
    (   $w      $h      0       )   //2
    (   0       $h      0       )   //3

    (   0       0       $depth  )   //4
    (   $w      0       $depth  )   //5
    (   $w      $h      $depth  )   //6
    (   0       $h      $depth  )   //7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nPtsWide $nPtsHigh $nDepthPts) simpleGrading
(1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type            patch;
        faces
        (
            (0 1 5 4)
        );
    }
    outlet
    {
        type            patch;
        faces
        (
            (2 3 7 6)
        );
    }
    walls
    {
        type            wall;
        faces
        (
            (0 4 7 3)
            (5 1 2 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //)))))
